app/controllers/animals_controller.rb

  def index
    @animals = Animal.all
---
SELECT "animals".* FROM "animals"

  def update
    if @animal.update(animal_params)
---
UPDATE "animals" SET "unique_tag" = ?, "updated_at" = ? WHERE "animals"."id" = ?  [["unique_tag", "abaa"], ["updated_at", "2022-11-22 13:02:04.311346"], ["id", 1]]

  def create
    @animal = Animal.new(animal_params)

    if @animal.save
---
INSERT INTO "animals" ("unique_tag", "name", "species", "breed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["unique_tag", "a"], ["name", "a"], ["species", "a"], ["breed", "a"], ["created_at", "2022-11-21 17:06:17.993560"], ["updated_at", "2022-11-21 17:06:17.993560"]]

  def destroy
    if @animal.destroy
---
DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 1]]

  def set_animal
    @animal = Animal.find(params[:id])
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]