app/controllers/veterinarians_controller.rb

  def index
    @veterinarians = Veterinarian.all
---
SELECT "veterinarians".* FROM "veterinarians"

  def create
    @veterinarian = Veterinarian.new(veterinarian_params)
    is_valid_phone_number = @veterinarian.number.present? && @veterinarian.number.match?(Veterinarian::PHONE_REGEXP)

    respond_to do |format|
      if is_valid_phone_number && @veterinarian.save
---
INSERT INTO "veterinarians" ("name", "status", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Hannah"], ["status", "FRee"], ["number", "525428914"], ["created_at", "2022-11-21 17:26:47.035424"], ["updated_at", "2022-11-21 17:26:47.035424"]]

  def update
    respond_to do |format|
      if @veterinarian.update(veterinarian_params)
---
UPDATE "veterinarians" SET "name" = ?, "admin" = ?, "number" = ?, "updated_at" = ? WHERE "veterinarians"."id" = ?  [["name", "Hannaha"], ["admin", 1], ["number", "5254289142345"], ["updated_at", "2022-11-21 17:26:54.179269"], ["id", 1]]

  def destroy
    @veterinarian.destroy
---
DELETE FROM "veterinarians" WHERE "veterinarians"."id" = ?  [["id", 1]]

  def set_veterinarian
    @veterinarian = Veterinarian.find(params[:id])
---
SELECT "veterinarians".* FROM "veterinarians" WHERE "veterinarians"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]